[
  {
    "subreddit": "cancer",
    "title": "I’m not ready.",
    "score": 1510,
    "url": "https://www.reddit.com/r/cancer/comments/9isza1/im_not_ready/",
    "num_comments": 129,
    "created_utc": 1537888401.0,
    "selftext": "In 2016 I was diagnosed with stage 4 of a severely aggressive bone cancer after months of severe pain in my sacrum and left leg. I was diagnosed the month before I turned 16. \n\nEwing’s Sarcoma. Rare, and even rarer to have it where I did. One big angry tumour in my sacrum, wrapping around all the nerves in my leg. \nI named her Shannon. \n\nSo because it was an aggressive cancer, we needed to hit it with an even more aggressive chemo protocol. The protocol I was under would have killed an adult, but because I was/am a kid, it only severely harmed me. I was bedridden for the full year and a bit of treatment. \n\nI did 36 radiation fractions, and 11 rounds of chemo in my induction phase, and then a round every three weeks for a year. It was supposed to be every 2 weeks, but because it was hurting my body and threatening my blood counts so much, we had to add an extra week of recovery time. \n\nIt was the most horrible year of my life. All my friends were out partying and dating and having fun, and I was so sick I couldn’t even go to school. I was barely conscious at all. A few of my friends were amazing during it all and stuck by me, doing everything and anything to help the stress on me and my family. They were bloody amazing, and i’m never going to be able to repay them for making my year that bit easier. \n\nHalfway through treatment, I was admitted to the ICU after a few scary low blood pressure readings. I basically lived in hospital all year so it wasn’t much of a bother. I couldn’t really grasp how sick I was for those 8 days in the ICU until I overheard nurses talking about how if I hadn’t have made it down there that night, I would have died. \n\nSo a few major emergency surgeries later and another few months of treatment, I made it. \n\nI did it. I got my N.E.D (No Evidence of Disease, because there’s never a certain “you’re cancer free” with Ewings) January this year. I’d won. \nDuring my recovery, I went to physio and learnt how to walk again and got stronger. I even made it to school for a few days. \n\nAnd then the pain started. This time in my ribs on my right side. We treated the pain for a while, and then it was time for my 6 month check up scans. \nI lit up EVERYWHERE. \n\nI had a massive tumour in my spine, wrapping around my spinal cord and causing the pain in my ribs. \nThere were tumours in my ankles and legs and shoulders and lungs. \nIt was official. I’m terminal. \n\nThere’s no way to stop it, and I’m currently on more treatment to at least slow it down and buy me some time. \n\nI’m dying. I’m 17 - 18 in a few months. I’m not ready to die. I can’t. I can’t leave my family and friends behind. \n\nMy mum is my entire world. I love her more than anything and owe her everything I have and ever will have. She’s everything I could ever hope to be and I’m leaving her. She has to lose her daughter. I can’t do that to her. \n\nI’ve got an older sister - my best friend in the world. I can’t leave her either. We promised we’d grow old together. We promised we’d spoil each other’s kids. \n\nAnd then there’s my 12 year old brother - my baby. I’m supposed to look after him, to protect him. And I won’t be able to do that. He’s 12 for Christ’s sake he can’t lose his sister. I can’t do that to him - he should be worrying about not having enough v-bucks on fortnite for the new skin, not about how he’s going to deal with everything when his older sister fucking dies. \n\nAnd my half siblings, a 6 year old sister and a 2 year old brother. I love them more than anything in the entire world. My sister is my best friend and I’m hers. She looks up to me and I can’t leave her. I was supposed to watch them grow up and help her sneak out when she was older. I was supposed to be there to help them with homework and relationship trouble. \nAnd now I can’t. \n\nI’ll never see any of my younger siblings graduate or get their first girlfriends or boyfriends. I’ll never see them get married. I’ll never meet their kids. \n\nAnd the worst part is that they’re all so young that they’re gonna forget me. \nFor the 12 year old, he’ll remember me, but over the years it’s gonna get harder and harder to remember the times we’ve fought or played or bickered. He won’t remember my mannerisms or the times we’d spend hanging out in my room. \nAnd the babies won’t remember anything about me. That’s what’s breaking my heart. \nAll the games and the stories and the lullabies and the secrets - gone. They won’t remember anything. I’ll just be the older sister they never knew that passed away when she was a teenager. \n\nI can’t leave my family behind. I just can’t do it. I’m not ready. \n\nAnd my best friend. The friend that I was planning to move out after school with. The friend that has stuck by me the most. The friend that was ready to carry my children because I couldn’t anymore (thanks to the radiation). The friend that I was going to grow old with and bicker with endlessly. \nI’m not going to have her anymore. And again, I’ll just be the friend she had when she was young that passed away. \n\nI can’t do this. I don’t want to do this. But I don’t have a choice. \n\nMy doctor said he’d be surprised if I made it to the end of the year. That’s 2 months. \n2 months to say my goodbyes and to make as many memories as I can with as many of my loved ones as I can. \nI’m not ready. Please god please I just don’t want to die. \n\nI just needed to vent to someone, anyone. I’m sorry. It’s 1am and everyone’s asleep, and I didn’t want to burden my mum by letting her know I’m feeling like this right now. She worries too much as it is. \n\n\n***UPDATE*** \nSo I’m still here, as you can tell. I’ve been fighting like hell, and it definitely hasn’t been easy - but I’m okay. \nI’m doing well actually (head wise, at least). Pain is under control, nausea is under control and all that Jazz. \nI’ve stopped chemo, because towards the end it had just stopped working altogether. So for now we just zap any problematic tumours with radiation if they start causing too much pain / too many problems. \n\nI’ve recently had a fall, and really smacked my right foot. So it’s been out of action for about a week now, but i’m slowly recovering. \nI’ve also been on oxygen for a couple months now because my lungs just aren’t doing the job completely. Nothing too bad; as in I could technically go without the oxygen’s help - it just wouldn’t be too fun. \n\nOtherwise... I’ve really been okay. (Just don’t ask about my dad. Ugh. Lmao)\nWe all know my time’s coming, but if the time since I’ve made this post has meant anything - it means I can fight a little longer, as long as I’ve got my family and friends behind me. \n\nI appreciate all of you guys that have stuck by me and sent in your continuous support. It was always crazy sweet reading your messages and always really uplifting. So thank you. \n\nHere’s to this not being my last update, either!\nXxxx"
  },
  {
    "subreddit": "cancer",
    "title": "I’ve got 2-4 weeks to live, we’re in the end game now gang",
    "score": 1109,
    "url": "https://www.reddit.com/r/cancer/comments/m1h5h5/ive_got_24_weeks_to_live_were_in_the_end_game_now/",
    "num_comments": 174,
    "created_utc": 1615326168.0,
    "selftext": "Hey everyone you might have seen my post on here or comments throughout my time here. A few days ago the hospital oncologist gave me the bad news that my cancer had spread to my lungs. Also that I had a swollen lymph node in the groin that was perceived to be cancerous. \n\nSo yeah I have a 3-5 months if I were to do chemo except I’d be locked away in the hospital with no visitors. The other option is to not take any treatment go into hospice and live for about 2-4 months. We’ve opted for the latter because I wanted to be able to see family before I die. \n\nIt’s been hard the past few days to process this option but we are happy with the decision and are planning for a lot of visits. I’m excited to meet old and new friends I hadn’t met before. It’s a blessing that I didn’t anticipate but it brings me so much joy that’ll I’ll be meeting these people before I go.\n\nAnyways I could go on but I’ll keep this shortish r/cancer I love y’all and thanks for the laughs and support throughout my entire journey. \n\n-Jake"
  }
]