[
  {
    "subreddit": "AskDocs",
    "title": "My iris is disappearing?",
    "score": 0,
    "url": "https://www.reddit.com/r/AskDocs/comments/1mog301/my_iris_is_disappearing/",
    "num_comments": 1,
    "created_utc": 1755021868.0,
    "selftext": "Age:19 sex:F weight:175p \nOn no medication but frequently use Vaseline as well as a brand (skin fix) on all of my eczema including my eyelids\nI somtimes take a drink called magpop \nI have a few health issues that all kind of umbrella under an auto immune disorder \n(pcos, chronic eczema, ibs, early signs of arthritis, etc) I also have had many surgeries to fix my hearing and ear drum depletion so hoping i don’t go blind and deaf!\nA few weeks ago I noticed my iris looked a little funny kind of glowy almost as time went on I saw more of a difference as it started to “disappear” and turn a blueish grey.\nSome friends noticed it and others just said it was the ring around your eye. (Mind you it has now cut more into my eye and the iris is now not a perfect circle anymore, slanted on one side where the rest of my brown eye was and is now blueish grey)\nI have been to three doctors about this now\nregular optician: noticed what i was talking about but didn’t know what it was and also said it was starting in the other eye. sent me to a ophthalmologist.\nfamily physician: didn’t give me the time of day but sent me for a full cbc as requested result came back fine the only thing she mentioned was anemia which i also have had for awhile\nophthalmologist: Also didn’t give me the time of day and as soon as he saw my eczema he ran with it and suggested i see a dermatologist and recommended Protopic for the eyelids which weren’t the problem to begin with(I have been to dermatologist my whole life and also have used Protopic up until two years ago when i stopped using steroid creams) he also was going to give me 8 week antibiotics which he never explained why i would be going on them as he barley looked at my eye and didn’t say anything was wrong aside from a little bit of inflamed eyelashes.\n\nsooo yeah i mean it feels silly worrying as its not effecting my vision but I have no clue why this is happening i thought maybe it could be high cholesterol and a lipid deposit but my blood was fine as far as I know. \n(I have a few photos which I cant seem to post on this sub)\n\n\n\n"
  }
]